src/cfe/Documents/ВходящееПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВходящееПисьмо</Name>
		</Properties>
	</Document>
</MetaDataObject>

src/cfe/InformationRegisters/ИсполнителиРолей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИсполнителиРолей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Documents/ВходящееПисьмо/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЦППК_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	ПомечатьВходящиеПисьмаПрочтеннымиТолькоВручную =
		ВстроеннаяПочтаСервер.ПолучитьПерсональнуюНастройку("ПомечатьВходящиеПисьмаПрочтеннымиТолькоВручную");

	Если Не ПомечатьВходящиеПисьмаПрочтеннымиТолькоВручную Тогда
		
		УстановитьПривилегированныйРежим(Истина);

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПолномочияСотрудников.Полномочия КАК Полномочия,
		|	ПолномочияСотрудников.Владелец КАК Владелец
		|ПОМЕСТИТЬ СписокУчастниковРоли
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолномочияСотрудников КАК ПолномочияСотрудников
		|		ПО (ПрофилиГруппДоступа.Ссылка = ПолномочияСотрудников.Полномочия)
		|ГДЕ
		|	ПрофилиГруппДоступа.Ссылка = &Роль
		|	И ПолномочияСотрудников.Владелец <> &ТекущийСотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУчастниковРоли.Полномочия КАК Полномочия,
		|	СписокУчастниковРоли.Владелец КАК Участник
		|ПОМЕСТИТЬ РазвернутыеУчастники
		|ИЗ
		|	СписокУчастниковРоли КАК СписокУчастниковРоли
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(СписокУчастниковРоли.Владелец) = ТИП(Справочник.Сотрудники)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУчастниковРоли.Полномочия,
		|	РабочиеГруппыСостав.Участник
		|ИЗ
		|	СписокУчастниковРоли КАК СписокУчастниковРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеГруппы.Состав КАК РабочиеГруппыСостав
		|		ПО СписокУчастниковРоли.Владелец = РабочиеГруппыСостав.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(СписокУчастниковРоли.Владелец) = ТИП(Справочник.РабочиеГруппы)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУчастниковРоли.Полномочия,
		|	Сотрудники.Ссылка
		|ИЗ
		|	СписокУчастниковРоли КАК СписокУчастниковРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СписокУчастниковРоли.Владелец = Сотрудники.Подразделение
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(СписокУчастниковРоли.Владелец) = ТИП(Справочник.СтруктураПредприятия)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокУчастниковРоли.Полномочия,
		|	ИсполнителиРолей.Исполнитель
		|ИЗ
		|	СписокУчастниковРоли КАК СписокУчастниковРоли
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиРолей КАК ИсполнителиРолей
		|		ПО СписокУчастниковРоли.Владелец = ИсполнителиРолей.РольИсполнителя
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(СписокУчастниковРоли.Владелец) = ТИП(Справочник.ПолныеРоли)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиПользователей.Пользователь КАК Пользователь,
		|	РазвернутыеУчастники.Полномочия КАК Полномочия
		|ПОМЕСТИТЬ Пользователи
		|ИЗ
		|	РазвернутыеУчастники КАК РазвернутыеУчастники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователей КАК СотрудникиПользователей
		|		ПО (РазвернутыеУчастники.Участник = СотрудникиПользователей.Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.Пользователь КАК Пользователь
		|ИЗ
		|	Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Пользователь ЕСТЬ NULL";

		Запрос.УстановитьПараметр("ТекущийСотрудник", Сотрудники.СотрудникиПользователя(Пользователи.ТекущийПользователь())[0]);
		Запрос.УстановитьПараметр("Роль", Справочники.ПрофилиГруппДоступа.ПолучитьСсылку(Новый УникальныйИдентификатор("8246fc86-fa78-11ee-9903-005056bf28da")));

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
			Запись = РегистрыСведений.СведенияОПрочтении.СоздатьМенеджерЗаписи();
			Запись.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
			Запись.Объект = ТекущийОбъект.Ссылка;
			Запись.Прочитать();
			
			Запись.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
			Запись.Объект = ТекущийОбъект.Ссылка;
			Запись.Прочтен = Истина;
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли; 
	
КонецПроцедуры
